nuclei-v3/S/sap-getinstanceproperties-disclosure.yaml

http:
- matchers:
  - condition: and
    part: body
    type: word
    words:
    - GetInstancePropertiesResponse
    - <property>Webmethods</property>
  - status:
    - 200
    type: status
  matchers-condition: and
  raw:
  - "POST / HTTP/1.1\nHost: {{Hostname}}\nContent-Type: text/xml; charset=UTF-8\n\
    SOAPAction: '\"\"'\n\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<SOAP-ENV:Envelope\
    \ xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <SOAP-ENV:Header>\n\
    \    <sapsess:Session xmlns:sapsess=\"http://www.sap.com/webas/630/soap/features/session/\"\
    >\n      <enableSession>true</enableSession>\n    </sapsess:Session>\n  </SOAP-ENV:Header>\n\
    \  <SOAP-ENV:Body>\n    <ns1:GetInstanceProperties xmlns:ns1=\"urn:SAPControl\"\
    />\n  </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>\n"
id: sap-getinstanceproperties-disclosure
info:
  author: LRVT,l4rm4nd
  description: 'Detected SAP systems where the SAP Start Service (sapstartsrv) SAPControl
    SOAP interface exposes the GetInstanceProperties method without requiring authentication.

    '
  metadata:
    max-request: 1
  name: SAPControl Webmethods - Disclosure
  reference:
  - https://community.sap.com/t5/technology-blog-posts-by-members/securing-the-sap-instance-agent-sap-start-service/ba-p/13486679
  - https://help.sap.com/docs/SUPPORT_CONTENT/si/3362958690.html
  - https://help.sap.com/docs/SUPPORT_CONTENT/si/3362959700.html
  - https://www.neteye-blog.com/2017/03/sap-monitoring-experiences-with-sapcontrol-and-check_sap_health/
  - https://redrays.io/blog/extended-security-settings-for-sapstartsrv-sap-security-note-1439348/
  severity: medium
  tags: misconfig,sap,sapcontrol,soap,exposure
